app/views/tracks/show.html.erb

SELECT "track_items".* FROM "track_items" WHERE "track_items"."track_id" = ?  [["track_id", 1]]
---
<ol>
  <% @track.track_items.each do |track_item| %>