app/controllers/tracks_controller.rb

SELECT  "track_items".* FROM "track_items" WHERE "track_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # @track = Track.find(params[:id])
    @track = Track.includes(:track_items).find(params[:id])